{
    "world news": "Russia's top diplomat, Sergey Lavrov, has accused the United States, South Korea, and Japan of preparing for war with North Korea. Lavrov claims that this new military bloc, brought together by the US, is increasing military activity and conducting large-scale exercises. Meanwhile, the top UN court is set to rule on South Africa's request for interim orders, including a demand for Israel to halt its Gaza offensive. Additionally, the US has carried out airstrikes in Iraq, targeting Iranian-backed militias in response to repeated attacks on US forces. The Doomsday Clock, a symbolic representation of the world's proximity to annihilation, has been reset to 90 seconds to midnight for the second consecutive year by atomic scientists. Lastly, Turkey has finally approved Sweden's NATO membership bid after a 20-month delay, and Chinese Premier Li Qiang has met with President Shavkat Mirziyoyev of Uzbekistan in Beijing.",
    "national news": "Maine's Supreme Court has dismissed an appeal from the secretary of state to rule on her decision to bar former President Trump from the state's primary ballot. Voters in New Hampshire have shared their top choices for Trump's running mate for the 2024 election ahead of the New Hampshire primary. FOX News Channel's special coverage of the 2024 New Hampshire primary had 4 million viewers, surpassing other cable news networks. In Arizona, Kari Lake successfully pushed out the state's top Republican Party official after he allegedly tried to bribe her to stay out of politics. Top aides of President Biden are leaving the White House for campaign leadership roles, which is partly attributed to former President Trump's consolidation of support in the Republican Party. Donald Trump won the New Hampshire GOP primary, further solidifying his hold on the Republican Party. The Indian Meteorological Department has issued a red alert for a cold wave in four states in North India, causing disruptions in train and flight schedules.",
    "entertainment news": "In recent entertainment news, the Razer Huntsman V3 Pro keyboard is recommended as one of the top gifts for gamers. It features onboard storage and N-key rollover with anti-ghosting, making it a popular choice among gamers. Barrett-Jackson's 2024 Scottsdale auction saw cars trading in the six figures, highlighting the high demand for luxury vehicles. Ryan Gosling expressed gratitude for his Oscar nomination for his role in \"Barbie,\" but criticized the Academy for snubbing director Greta Gerwig and star Margot Robbie. Hrithik Roshan and Deepika Padukone's film \"Fighter\" has been banned in Gulf countries and will only release in the UAE. Alia Bhatt wore a Ramayana-themed saree for the opening of Ram Mandir in Ayodhya, which showcased events from the epic in miniature form.",
    "science news": "The Harvard-affiliated Dana-Farber Cancer Institute is retracting and correcting numerous papers by top researchers following allegations of data falsification. The institute, known for its contributions to cancer research, has launched a probe into the matter. This incident raises concerns about the reliability of scientific studies and highlights the importance of rigorous data verification and peer review processes. The retraction and correction of these papers may have significant implications for the scientific community and the reputation of the researchers involved.",
    "technology news": "OnePlus has officially launched its highly anticipated OnePlus 12 series in the global market, including India. The series includes the OnePlus 12 and OnePlus 12R smartphones, both equipped with advanced camera features and powered by Qualcomm's flagship processor. This launch comes as a major move by the Chinese consumer tech giant to expand its market presence and offer cutting-edge technology to consumers. The OnePlus 12 series is expected to attract tech enthusiasts and smartphone users looking for top-notch performance and photography capabilities.",
    "finance news": "The Bank of Canada has held its key interest rate at 5%, according to Governor Tiff Macklem and Senior Deputy Governor Carolyn Rogers. The benchmark Sensex and Nifty indices are expected to open firm in India, with a gain of 87 points. eBay is laying off 1,000 employees, which accounts for 9% of the company, in an effort to become more nimble. United Airlines is reevaluating its plans for Boeing's largest 737 Max jet, the Max 10, following the grounding of Max 9s by the government.",
    "sports news": "In recent sports news, the No. 21 Creighton women's basketball team narrowly defeated Georgetown with a score of 77-72. Lauren Jensen and Morgan Maly led the team with 21 and 20 points respectively. Emma Ronsiek and Maddie Mogensen also contributed with 15 and 11 points. Switching to football, as the 2024 NFL draft approaches, analysts are predicting the landing spots for the top offensive players. Moving on to basketball again, the Miami Heat and Charlotte Hornets made a trade, with Terry Rozier going to Miami and Kyle Lowry joining Charlotte. Lastly, Adrian Beltre, Todd Helton, and Joe Mauer have been voted into the Baseball Hall of Fame."
}
